**Q1.** Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

**Answer**:

In [2]:
import pandas as pd 
data = [4,8,15,16,23,42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

**Q2.** Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

**Answer**:

In [3]:
import pandas as pd 
vari=["ram","shayam","mohan","geeta","seeta","awadhesh","shubhma","gaurav","himanshu","shreya"]
series2=pd.Series(vari)
print(series2)

0         ram
1      shayam
2       mohan
3       geeta
4       seeta
5    awadhesh
6     shubhma
7      gaurav
8    himanshu
9      shreya
dtype: object

**Q3.** Create a Pandas DataFrame that contains the following data:

**Answer**:

In [4]:
import pandas as pd
given_data ={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gendre':['Female','Male','Female']
}
df=pd.DataFrame(given_data)
df

     Name  Age  Gendre
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
df

        Age  Gendre
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

**Q4.** What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**Answer**:In Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different data types. It is similar to a spreadsheet or a SQL table, where each column can be thought of as a Pandas Series.

A Pandas Series, on the other hand, is a one-dimensional labeled array capable of holding data of any type. It can be considered as a single column of dataFrame.
In simpler terms, a Pandas Series is a single-dimensional object, while a Pandas DataFrame is a two-dimensional object, where each column of the DataFrame is a Pandas Series.
Exampple:

In [14]:
import pandas as pd
Fruits = ['apple','banana','mango','orange']
fruits_series=pd.Series(Fruits)
print(fruits_series)

0     apple
1    banana
2     mango
3    orange
dtype: object

In [16]:
import pandas as pd 
df_Fruits={
    'Fruits':['apple','banana','mango','orange'],
    'Price':[50,40,100,60],
    'Quantity':[4,12,5,7]
}
df=pd.DataFrame(df_Fruits)
df

   Fruits  Price  Quantity
0   apple     50         4
1  banana     40        12
2   mango    100         5
3  orange     60         7

**Q5.**: What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

**Answer**:

**1.head() and tail()**: These functions allow you to view the top or bottom rows of a DataFrame.

In [20]:
## we will usinf dataframe of question 4
df.head(2)

   Fruits  Price  Quantity
0   apple     50         4
1  banana     40        12

**2**. describe(): This function generates descriptive statistics for a DataFrame, including count, mean, standard deviation, minimum and maximum values, and quartiles. For example:

In [22]:
df.describe()

            Price   Quantity
count    4.000000   4.000000
mean    62.500000   7.000000
std     26.299556   3.559026
min     40.000000   4.000000
25%     47.500000   4.750000
50%     55.000000   6.000000
75%     70.000000   8.250000
max    100.000000  12.000000

**3**. sort_values(): This function allows you to sort a DataFrame by one or more columns. For example:

In [23]:
df = df.sort_values('Price', ascending=False)

In [24]:
df

   Fruits  Price  Quantity
2   mango    100         5
3  orange     60         7
0   apple     50         4
1  banana     40        12

**4** drop(): This function allows you to drop rows or columns from a DataFrame. For example:

**5.** groupby(): This function allows you to group rows of a DataFrame based on one or more columns, and perform aggregation functions on the groups.

**Q6.** Which of the following is mutable in nature Series, DataFrame, Panel?

**Answer**: Both Series and DataFrame are mutable in nature, which means you can modify their values, add or remove rows or columns.

Panel is a three-dimensional data structure which is capable of holding data of different data types. It can be considered as a container of DataFrame objects. Panel objects are mutable in nature, which means you can modify their values, add or remove items or dimensions.

**Q7.** Create a DataFrame using multiple Series. Explain with an example.

**Answer**:

In [37]:
import pandas as pd 
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])
salaries = pd.Series([50000, 60000, 70000])
data = {'Name':names,'Age':ages,'Salary':salaries}
df=pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000